# linux commands
#ctrl + alt + t - команда для открытия терминала
# ~ - символ домашней директории
# / - символ корневой директории

# . - обозначает текущую директорию
# .. - обозначает предыдущию директорию

# 1. ls - команда для вызова всех директорий(папка) и файлов в текущей (рабочей) директории в терминале
# 2. cd(change directory) - команда для перехода из одной директории в другую
# 3. mkdir - создает папки
# 4. touch - создает файлы
# 5. rmdir - удаляет пустую директорию
# 6. rm - удаляет файл
# 7. rm -rf удаляет вообще все(принудительно)
# 8. ls -a - показывает скрытые и обычные файлы и директории
# 9. ls -la - показывает подробную информацию
# pwd(print working directory) - выводит путь до текущей директории
# 10*. cp - копирует файл или директорию в указанное место cp <название><куда>
# 11*. mv - команда для перемещеня файла или директории, а также для переименования файла или директации
#   переименование : mv john.txt jamie.txt
#   перемещение : mv john.txt directory/
# 12. cat - показывает содержание файла
# 13. nano - открывает файл для редактирования в графическом интерфейсе Нано
#   если нет файла, то нано создаст новый
# nano test.txt
# 14. echo - команда для быстрой записи текста в файл
#   есho текст > файл
