# 1) Создайте переменную x и дайте ей любое числовое значение
# 1.1 Создайте переменную y и дайте ей любое числовое значение
# 1.2 Найдите сумму,произведение,вычитание чисел x,y  . Итоги запишите в другие переменные

x = 7
y = 8
a = x + y
b =  x * y
c = x - y
print(a, b, c)

# 2) Создайте переменную name и выведите 'name' 5 раз(Используя print 1 раз)
name = 'Diana'
num = 5
print( num * name)

# 3) Создайте переменную phone, brand, year дайте им значения
# Вывод данных должен иметь такой вид:
# Модель телефона "phone" компании "brand" "year" года

phone = 'Iphone'
brand = 'Apple'
year = 2023
print ("Модель телефона", phone, "компании", brand, year, "года")