""" 1) Создайте список и проверьте, является ли каждый элемент этого списка членом другого "черного списка". Если элемент находится в черном списке, выведите, что он в черном списке, в противном случае выведите, что с ним можно связаться.
"""
# kontakt = ['Kasandra', 'ex', 'Altai', 'Putin', 'Papa']
# blocked = ['ex', 'Putin']

# for x in kontakt + blocked:
#     if x in blocked:
#         print(f'blocked: {x}')
#     if x in kontakt and x not in blocked:
#         print(f'можно связаться c {x}')
"""
2) Создайте список из 10 случайных чисел от 1 до 100. Выведите список и найдите сумму, среднее значение и максимальное число в списке.
"""


"""
3) Создайте два списка чисел. Используйте вложенные циклы for и условные операторы, чтобы создать новый список, содержащий только четные числа, которые есть в обоих списках. 
"""


""" 4) Фильтрация строк:

Создайте список строк.
Используйте цикл для вывода только тех строк, длина которых больше 5 символов.

"""

""" 5) Операции с парами:

Создайте два списка чисел одинаковой длины.
Сложите соответствующие элементы этих списков и создайте новый список.

# """ 

ls1 = [1, 2, 3, 4, 5, 6, 7]
ls2 = [1, 2, 3, 4, 5, 6, 7]

# for x in ls1:

# 6) Исключение элементов:

# Создайте список чисел.
# Исключите из списка все числа, которые не кратны 3.

# """
# # ls = [1, 2, 3, 4, 5, 6]
# # ls1 = []
# # for x in ls:
# #     if x % 3 != 0:
# #         ls1.append(x)
# # print(ls1)
